
from dotenv import load_dotenv
import os

load_dotenv()

TOKEN = os.getenv("TOKEN")

PREFIX = os.getenv("PREFIX")

CHAT_CHANNELS_IDS = [int(x) for x in os.getenv("CHAT_CHANNELS_IDS").split(",")]
ROLES_CHANNEL_ID = int(os.getenv("ROLES_CHANNEL_ID"))
ROLES_MESSAGE_ID = int(os.getenv("ROLES_MESSAGE_ID"))
MAX_ROLES = int(os.getenv("MAX_ROLES"))

PRIVILEGED_ROLES_IDS = [int(x) for x in os.getenv("PRIVILEGED_ROLES_IDS").split(",")]
BAD_ROLES_IDS = [int(x) for x in os.getenv("BAD_ROLES_IDS").split(",")]

ROLES = {
    "<:Nichosi_1:823894832068952144>": 838042973463248927, # ничоси
    "<:Nichosi_18:882920659888533545>": 835140516416192563, # ничосити
    "<:Nichosi_2:823893403825078293>": 884440282458882058, # засвет
    "<:Nichosi_10:824136027760230431>": 917701939821682698, # ***
    "<:Kachosi:891593302799974400>": 835140679809630279, # качоси
}

HI_WORDS = (
    "привет",
    "прив",
    "здрасте",
    "здрасьте",
    "хелло",
    "всем привет",
    "привет,",
    "здарова",
    "здаров",
    "хай",
    "ку",
    "кy",
    "kу",
    "ky",
    "привки",
    "прифки",
    "приффки",
    "хилло",
    "хило",
    "здаров",
    "дарова",
    "даров",
    "драсьте",
    "дароу",
    "здароу",
    "утро доброе",
    "вечер добрый",
    "день добрый",
    "добрый день",
    "доброе утро",
    "добрый вечер",
    "хало",
    "хайло",
    "здрась",
    "я жив",
    "я живое",
    "я живой",
    "приветос",
    "приветствую",
    "прувэт",
    "прувет",
    "бонжур",
    "бомжур",
    "хей",
    "приветик",
    "салют",
    "доброго времени суток",
    "нихао",
    "ни хао",
    "hey",
    "hello",
    "hi",
    "hi there",
    "zdarova",
    "privet",
    "zdraste",
    "zdarov",
    "darou",
    "daroy",
    "zdarou",
    "zdaroy",
    "hallo",
    "hellow",
    "halo",
    "nihao",
    "ni hao",
    "good morning",
    "good evening",
    "good day",
    "good afternoon",
)

ANSWERS = (
    "утро доброе",
    "привет",
    "типа здрасьте",
    "дароу",
    "приветствую",
    "день добрый",
    "ку",
)

NICHOSI_ATTACK_WORDS = (
    "ничоси сука в атаку",
    "ничоси атака",
    "ничоси в атаку",
    "ничосе атака",
    "ничосе в атаку",
    "ничосики в атаку",
    "ничосики атака",
    "в атаку",
    "атакуем",
    "капчоси атака",
    "капчоси в атаку",
    "капчосе атака"
    "капчосе в атаку",
    "капчёси атака",
    "капчёси в атаку",
    "капчёсе атака",
    "капчёсе в атака"
    "атака",
    "атака нахер",
    "атака нахуй",
    "атака нахой"
    "атака нахрен"
    "в атаку нахер",
    "в атаку нахуй",
    "в атаку нахой",
    "в атаку нахрен",
)

NICHOSI_WORDS = ("ничоси", "nichosi", "ничосе")